## Importing The Libraries

In [33]:
import pandas as pd
import os

In [34]:
os.chdir("H:\\COGNITIOR Data Science\\dataframes\\")

In [35]:
# Reading the Data By Making the DataFrame

df = pd.read_csv("data.csv")

In [36]:
# DataFrame is

df

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   27   48000       Yes
2  Germany   30   54000        No
3    Spain   45   61000        No
4  Germany   40   45000       Yes
5   France   35   58000       Yes
6    Spain   39   52000        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   37   67000       Yes

In [37]:
# To see First Five Data Value

df.head(5)

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   27   48000       Yes
2  Germany   30   54000        No
3    Spain   45   61000        No
4  Germany   40   45000       Yes

In [38]:
#To see Last Five Dataset Value

df.tail(5)

   Country  Age  Salary Purchased
5   France   35   58000       Yes
6    Spain   39   52000        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   37   67000       Yes

# Calculting the Mean Of the Data

In [39]:
#   Mean/Average :-   


#               Sum Of Number Of terms
#         Mean=------------------------ 
#                 Number OF terms
#
#  Mean is Easily Influenced by the Single Entry Of element(Outliers) in Given Dataset
#  It doesn't gives the true nature

In [41]:
# Here we are Calculating the mean of Salary Columns by using mean() funcation

mean_data = df['Salary'].mean()

In [43]:
print(mean_data)

61900.0